RhinoInside.Revit API Documentation
GeometryDecoder.ToMesh Method
 Converts the specified Autodesk.Revit.DB.Mesh to an equivalent Rhino.Geometry.Mesh.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.Mesh ToMesh(
	this Autodesk.Revit.DB.Mesh mesh
)
@staticmethod
def ToMesh(
	mesh: Autodesk.Revit.DB.Mesh
) -> Rhino.Geometry.Mesh
Parameters
mesh
Type: Autodesk.Revit.DB.Mesh
Revit mesh to convert.
Return Value
Type: Rhino.Geometry.Mesh
Rhino mesh that is equivalent to the provided Revit mesh.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Mesh. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToMesh(Mesh) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Mesh rhinoMesh = revitMesh.ToMesh();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_mesh = revit_mesh.ToMesh() # type: RG.Mesh
 Using ToMesh(Mesh) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Mesh rhinoMesh = GeometryEncoder.ToMesh(revitMesh)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_mesh = GD.ToMesh(revit_mesh) # type: RG.Mesh
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace